export const ISSUE_DATA = {
    "issues": [
      {
        "name": "전자결제",
        "related": ["디지털화폐", "증권", "은행", "게임", "지역화폐", "AI S/W", "화장품", "전선", "암호화폐"],
        "weight": 30
      },
      {
        "name": "암호화폐",
        "related": ["자동차", "전력설비", "AI S/W", "콘텐츠"],
        "weight": 20
      }
    ],
    "stocks": [
      {
        "date": "2025-05-09",
        "헥토파이낸셜": 0,
        "카카오페이": -1,
        "다날": -2,
        "더존": -3
      },
      {
        "date": "2025-06-09",
        "헥토파이낸셜": 35,
        "카카오페이": 30,
        "다날": 28,
        "더존": 22
      }
    ]
  }
  