export const TRADING_CATEGORY_DETAILS = {
  '주식': {
    fee: 0.00015,
    tax: 0.0023, // 0.23%
  },
  'ETF': {
    fee: 0.00015,
    tax: 0, // 증권거래세 면제
  },
  'ETN': {
    fee: 0.00015,
    tax: 0, // 증권거래세 면제
  },
  '선물': {
    fee: 0.00015,
    tax: 0, // 개별 과세 없음
  },
  '옵션': {
    fee: 0.00015,
    tax: 0, // 개별 과세 없음
  },
  '리츠': {
    fee: 0.00015,
    tax: 0.0023, // 0.23%
  },
  '채권': {
    fee: 0.00015,
    tax: 0, // 이자소득 별도 과세
  },
  '펀드': {
    fee: 0.00015,
    tax: 0.154, // 배당소득세 15.4%
  },
  'ELS/DLS': {
    fee: 0.00015,
    tax: 0.154, // 배당소득세 15.4%
  },
  '해외주식': {
    fee: 0.00015,
    tax: 0.22, // 양도소득세 22%
  },
  '해외ETF': {
    fee: 0.00015,
    tax: 0.22, // 양도소득세 22%
  },
  '해외선물': {
    fee: 0.00015,
    tax: 0, // 개별 과세 없음
  },
  '해외채권': {
    fee: 0.00015,
    tax: 0.154, // 이자소득세 15.4%
  },
  '금': {
    fee: 0.00015,
    tax: 0.1, // 대표적으로 금 현물 기준 부가세 10%
  },
  '원유': {
    fee: 0.00015,
    tax: 0.1, // 대표적으로 금 현물 기준 부가세 10%
  },
  '은': {
    fee: 0.00015,
    tax: 0.1, // 대표적으로 금 현물 기준 부가세 10%
  },
  '외환': {
    fee: 0.00015,
    tax: 0, // 과세 없음
  },
} as const;

export const KOREA_STOCK_THEMES = {
  "산업/기술": [
    "AI(인공지능)",
    "반도체",
    "2차전지",
    "로봇",
    "전기차",
    "수소차",
    "메타버스",
    "클라우드",
    "빅데이터",
    "사물인터넷(IoT)",
    "스마트팜",
    "스마트팩토리",
  ],
  "정책/정부지원": [
    "SOC(사회간접자본)",
    "방위산업(방산)",
    "원전(원자력발전)",
    "신재생에너지",
    "탄소배출권",
    "정치테마주",
    "교육정책",
    "우주항공산업",
    "자율주행",
  ],
  "바이오/의료": [
    "바이오시밀러",
    "유전자치료",
    "헬스케어",
    "의료기기",
    "제약바이오",
  ],
  "소비/트렌드": [
    "K-콘텐츠",
    "K-뷰티",
    "K-푸드",
    "게임",
    "OTT",
    "드론",
    "여행",
    "면세점",
    "엔터테인먼트",
    "플랫폼 기업",
    "패션/의류",
  ],
  "금융/가상자산": [
    "핀테크",
    "비트코인",
    "NFT",
    "블록체인",
    "증권/보험",
    "마이데이터",
  ],
  "기타": [
    "철강",
    "조선",
    "건설",
    "부동산",
    "물류",
    "농업",
    "리츠(REITs)",
    "자원개발",
    "식품",
    "폐기물 처리",
  ],
};

export const KOREA_STOCK_KEYWORDS = {
  "2차전지": [
    "대보마그네틱",
    "나인테크",
    "하나기술",
    "솔브레인홀딩스",
    "솔브레인"
  ],
  "암호화폐": [
    "우리기술",
    "우리기술투자"
  ],
  "스테이블코인": [
    "다날",
    "미투온"
  ],
  "토큰증권": [
    "아이티센글로벌",
    "갤럭시아머니트리",
    "핑거",
    "아이티아이즈",
    "뱅크웨어글로벌"
  ],
  "반도체": [
    "삼성전자",
    "SK하이닉스",
    "심텍",
    "두산테스나",
    "아이씨켐"
  ],
  "게임": [
    "엔씨소프트",
    "넷마블",
    "더블유게임즈",
    "데브시스터즈",
    "펄어비스"
  ],
  "지역화폐": [
    "갤럭시아머니트리",
    "웹케시",
    "인스코비"
  ],
  "자율주행": [
    "모트렉스",
    "모바일어플라이언스",
    "인포뱅크",
    "KEC",
  ],
  "코로나19": [
    "그린생명과학",
    "수젠텍",
    "더바이오메드",
    "랩지노믹스"
  ],
  "화장품": [ 
    "아모레퍼시픽",
    "한국콜마",
    "한국화장품제조",
    "코스맥스비티아이",
    "토니모리"
  ],
  "풍력": [
    "LS에코에너지",
    "효성중공업",
    "효성",
    "GS글로벌",
    "DMS"
  ],
  "제약바이오": [
    "셀트리온",
    "셀트리온제약",
    "리가켐바이오",
    "디앤디파마텍",
    "알테오젠"
  ],
  "지주회사": [
    "코오롱",
    "HS효성",
    "HD현대",
    "한화",
    "SK"
  ],
  "원전": [
    "한전산업",
    "성광벤드",
    "태웅"
  ],
  "증권": [
    "미래에셋증권",
    "NH투자증권",
    "삼성증권",
    "키움증권",
    "대신증권"
  ],
  "방산": [
    "한화에어로스페이스",
    "한국항공우주산업",
    "LIG넥스원",
    "퍼스텍",
    "현대로템"
  ],
  "엔터": [
    "하이브",
    "JYP Ent.",
    "에스엠",
    "와이지엔터테인먼트",
    "큐브엔터"
  ], 
  "금융": [
    "KB금융",
    "NH투자증권",
    "삼성생명",
    "신한지주",
    "신한알미늄"
  ],
};