export const TRADING_CATEGORY_DETAILS = {
  '주식': {
    fee: 0.00015,
    tax: 0.0023, // 0.23%
  },
  'ETF': {
    fee: 0.00015,
    tax: 0, // 증권거래세 면제
  },
  'ETN': {
    fee: 0.00015,
    tax: 0, // 증권거래세 면제
  },
  '선물': {
    fee: 0.00015,
    tax: 0, // 개별 과세 없음
  },
  '옵션': {
    fee: 0.00015,
    tax: 0, // 개별 과세 없음
  },
  '리츠': {
    fee: 0.00015,
    tax: 0.0023, // 0.23%
  },
  '채권': {
    fee: 0.00015,
    tax: 0, // 이자소득 별도 과세
  },
  '펀드': {
    fee: 0.00015,
    tax: 0.154, // 배당소득세 15.4%
  },
  'ELS/DLS': {
    fee: 0.00015,
    tax: 0.154, // 배당소득세 15.4%
  },
  '해외주식': {
    fee: 0.00015,
    tax: 0.22, // 양도소득세 22%
  },
  '해외ETF': {
    fee: 0.00015,
    tax: 0.22, // 양도소득세 22%
  },
  '해외선물': {
    fee: 0.00015,
    tax: 0, // 개별 과세 없음
  },
  '해외채권': {
    fee: 0.00015,
    tax: 0.154, // 이자소득세 15.4%
  },
  '금/원유/은 등 원자재': {
    fee: 0.00015,
    tax: 0.1, // 대표적으로 금 현물 기준 부가세 10%
  },
  '외환': {
    fee: 0.00015,
    tax: 0, // 과세 없음
  },
} as const;

export const KOREA_STOCK_THEMES = {
  "산업/기술": [
    "AI(인공지능)",
    "반도체",
    "2차전지",
    "로봇",
    "전기차",
    "수소차",
    "메타버스",
    "클라우드",
    "빅데이터",
    "사물인터넷(IoT)",
    "스마트팜",
    "스마트팩토리",
  ],
  "정책/정부지원": [
    "SOC(사회간접자본)",
    "방위산업(방산)",
    "원전(원자력발전)",
    "신재생에너지",
    "탄소배출권",
    "정치테마주",
    "교육정책",
    "우주항공산업",
    "자율주행",
  ],
  "바이오/의료": [
    "바이오시밀러",
    "유전자치료",
    "헬스케어",
    "의료기기",
    "제약바이오",
  ],
  "소비/트렌드": [
    "K-콘텐츠",
    "K-뷰티",
    "K-푸드",
    "게임",
    "OTT",
    "드론",
    "여행",
    "면세점",
    "엔터테인먼트",
    "플랫폼 기업",
    "패션/의류",
  ],
  "금융/가상자산": [
    "핀테크",
    "비트코인",
    "NFT",
    "블록체인",
    "증권/보험",
    "마이데이터",
  ],
  "기타": [
    "철강",
    "조선",
    "건설",
    "부동산",
    "물류",
    "농업",
    "리츠(REITs)",
    "자원개발",
    "식품",
    "폐기물 처리",
  ],
};

